wer3600/stm32/09.07/3_UartTx_Printf/Src/main.c
#include"stm32f4xx_hal.h"
#include<stdio.h>



UART_HandleTypeDef huart2 ;


void uart_init(void) ;

char message[20] = "Hello from STM32\r\n" ;


int __io_putchar(int ch)
{
	HAL_UART_Transmit(&huart2, (uint8_t *) &ch, 1, 10) ;
	return ch ;
}


int main()
{

	HAL_Init() ;
	uart_init();



	while(1)
	{
		printf("Printf is being used ! \n\r") ;
		HAL_Delay(10) ;
	}
}



void SysTick_Handler(void)
{
	HAL_IncTick() ;
}


void uart_init(void)
{

	GPIO_InitTypeDef GPIO_InitStruct = {0} ;

	//Enable UART pins clock access
	__HAL_RCC_GPIOA_CLK_ENABLE() ;

	//Enable UART module clock access
	__HAL_RCC_USART2_CLK_ENABLE() ;


	//Configure pins to act as alternate func pins(UART)

	GPIO_InitStruct.Pin 		= GPIO_PIN_2 | GPIO_PIN_3 ;
	GPIO_InitStruct.Mode 		= GPIO_MODE_AF_PP ;
	GPIO_InitStruct.Alternate 	= GPIO_AF7_USART2 ;
	GPIO_InitStruct.Pull		= GPIO_NOPULL ;
	GPIO_InitStruct.Speed		= GPIO_SPEED_FREQ_VERY_HIGH ;

	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct) ;

	//Configure UART
	huart2.Instance 		 = USART2 ;
	huart2.Init.BaudRate	 = 115200 ;
	huart2.Init.WordLength	 = UART_WORDLENGTH_8B ;
	huart2.Init.StopBits	 = UART_STOPBITS_1 ;
	huart2.Init.Parity		 = UART_PARITY_NONE ;
	huart2.Init.Mode		 = UART_MODE_TX ;
	huart2.Init.HwFlowCtl 	 = UART_HWCONTROL_NONE ;
	huart2.Init.OverSampling = UART_OVERSAMPLING_16 ;

	HAL_UART_Init(&huart2) ;




}
